
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       5 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                             |
|:--------:|:----------------------------------------------------------------------|
|    🟢     | `module.cdn.aws_acm_certificate.cdn`                                  |
|    🟢     | `module.cdn.aws_acm_certificate_validation.repo`                      |
|    🟢     | `module.cdn.aws_cloudfront_cache_policy.default`                      |
|    🟢     | `module.cdn.aws_cloudfront_distribution.repo`                         |
|    🟢     | `module.cdn.aws_route53_record.cert_validation["cdn.infrahouse.com"]` |
|    🟢     | `data.aws_iam_policy_document.webserver_permissions:`                 |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/54d4c0bd-9533-4232-af9e-50ff68659716/terraform-bin plan -no-color --out=tf.plan
data.aws_iam_policy_document.webserver_permissions: Reading...
data.aws_iam_policy_document.webserver_permissions: Read complete after 0s [id=2218315402]
module.website-vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0ae798f941be45345]
data.aws_availability_zones.uw1: Reading...
data.aws_ami.ubuntu_22: Reading...
module.website.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...
data.aws_key_pair.aleks: Reading...
module.website.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/webserver20230818170808801500000002]
module.website.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be]
module.website.data.aws_route53_zone.website: Reading...
module.website.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]
module.webserver_userdata.data.aws_region.current: Reading...
module.website-vpc.data.aws_vpc.management_vpc[0]: Reading...
module.webserver_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.website.data.aws_caller_identity.current: Reading...
data.aws_key_pair.aleks: Read complete after 0s [id=key-01c98b9723b518061]
data.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]
module.website.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=webserver20230818170808794200000001]
module.cdn.data.aws_route53_zone.ih_com: Reading...
module.webserver_userdata.data.template_cloudinit_config.config: Reading...
module.webserver_userdata.data.template_cloudinit_config.config: Read complete after 0s [id=1138369615]
data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-01973462ceff35e85]
module.website-vpc.aws_eip.nat_eip["10.0.4.0/24"]: Refreshing state... [id=eipalloc-03ad22a4199a2bfe5]
module.website-vpc.aws_eip.nat_eip["10.0.5.0/24"]: Refreshing state... [id=eipalloc-0beb080e46efeb93f]
module.website.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]
module.website-vpc.data.aws_vpc.management_vpc[0]: Read complete after 0s [id=vpc-08e19d859c26d18b2]
module.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Reading...
module.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Read complete after 0s [id=us-west-1]
module.website.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=webserver20230818170808794200000001-20230818170809342500000004]
module.website.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=webserver]
module.website-vpc.aws_route_table.all["10.0.5.0/24"]: Refreshing state... [id=rtb-0fc65675e5ce07bbf]
module.website-vpc.aws_route_table.all["10.0.4.0/24"]: Refreshing state... [id=rtb-02ae9fc349324835b]
module.website-vpc.aws_internet_gateway.ig: Refreshing state... [id=igw-0feb8f579048fc443]
module.website-vpc.aws_default_route_table.default: Refreshing state... [id=rtb-06b702bdb0cadd810]
module.website-vpc.aws_default_security_group.default: Refreshing state... [id=sg-089f1a85f05cbd32a]
module.website-vpc.aws_route_table.all["10.0.6.0/24"]: Refreshing state... [id=rtb-0decbbf0182384dff]
module.website-vpc.aws_route_table.all["10.0.7.0/24"]: Refreshing state... [id=rtb-0f0d4ab6650ed47a4]
module.website-vpc.aws_subnet.all["10.0.4.0/24"]: Refreshing state... [id=subnet-086ccf1b7842243d2]
module.website-vpc.aws_vpc_peering_connection.link_to_management[0]: Refreshing state... [id=pcx-0fd00008e9a890b35]
module.website.data.aws_route53_zone.website: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]
module.website-vpc.aws_subnet.all["10.0.6.0/24"]: Refreshing state... [id=subnet-01306fa9e14f9c980]
module.website-vpc.aws_subnet.all["10.0.5.0/24"]: Refreshing state... [id=subnet-05fa33164c768ab65]
module.website-vpc.aws_subnet.all["10.0.7.0/24"]: Refreshing state... [id=subnet-06f352185ffc3fcd3]
module.website.aws_route53_record.cert_validation["infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com._CNAME]
module.website.aws_route53_record.cert_validation["www.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com._CNAME]
module.website-vpc.aws_route.default_main: Refreshing state... [id=r-rtb-06b702bdb0cadd8101080289494]
module.website-vpc.aws_route.subnet_public["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b1080289494]
module.website-vpc.aws_route.subnet_public["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf1080289494]
module.website.aws_launch_template.website: Refreshing state... [id=lt-0cbf545f2a4d9f53c]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a4653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff653952448]
module.website-vpc.aws_route.route_from_me_to_mgmt["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b653952448]
module.website-vpc.aws_route.route_from_mgmt_to_me[0]: Refreshing state... [id=r-rtb-0d73383afeb6ad1423177957334]
module.website-vpc.aws_route.route_from_mgmt_to_me[1]: Refreshing state... [id=r-rtb-04a16e74d5b12a3383177957334]
module.website-vpc.aws_route.route_from_mgmt_to_me[2]: Refreshing state... [id=r-rtb-067c30e65dd4108e93177957334]
module.website-vpc.aws_nat_gateway.nat_gw["10.0.5.0/24"]: Refreshing state... [id=nat-00ac19ae43562352f]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.4.0/24"]: Refreshing state... [id=rtbassoc-04d711a4b92896be2]
module.website-vpc.aws_nat_gateway.nat_gw["10.0.4.0/24"]: Refreshing state... [id=nat-0a1c16012747ef5e4]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.5.0/24"]: Refreshing state... [id=rtbassoc-0716045ba5eb092f0]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.6.0/24"]: Refreshing state... [id=rtbassoc-0c1a3e4c874333baf]
module.website-vpc.aws_route_table_association.private_rt_assoc["10.0.7.0/24"]: Refreshing state... [id=rtbassoc-0da0fea7d999fcf5f]
module.website.data.aws_subnet.selected: Reading...
module.website.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055]
module.website-vpc.aws_route.subnet_private["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a41080289494]
module.website-vpc.aws_route.subnet_private["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff1080289494]
module.website.data.aws_subnet.selected: Read complete after 0s [id=subnet-086ccf1b7842243d2]
module.website.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2023081817082140120000000a/4bab1c874db740af]
module.cdn.data.aws_route53_zone.ih_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]
module.website.aws_acm_certificate_validation.website: Refreshing state... [id=2023-08-18 17:08:33.177 +0000 UTC]
module.website.aws_route53_record.primary: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_A]
module.website.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_www_A]
module.website.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/3d984bc9f1cc3a7d]
module.website.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70]
module.website.aws_autoscaling_group.website: Refreshing state... [id=web-2023081817082248860000000b]
module.website.aws_autoscaling_policy.cpu_load: Refreshing state... [id=web-2023081817082248860000000b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cdn.aws_acm_certificate.cdn will be created
  + resource "aws_acm_certificate" "cdn" {
      + arn                       = (known after apply)
      + domain_name               = "cdn.infrahouse.com"
      + domain_validation_options = [
          + {
              + domain_name           = "cdn.infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "cdn.infrahouse.com",
        ]
      + tags_all                  = {
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.cdn.aws_acm_certificate_validation.repo will be created
  + resource "aws_acm_certificate_validation" "repo" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.cdn.aws_cloudfront_cache_policy.default will be created
  + resource "aws_cloudfront_cache_policy" "default" {
      + default_ttl = 300
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 600
      + min_ttl     = 60
      + name        = "ih-backend_default"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + cookies_config {
              + cookie_behavior = "none"
            }
          + headers_config {
              + header_behavior = "none"
            }
          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # module.cdn.aws_cloudfront_distribution.repo will be created
  + resource "aws_cloudfront_distribution" "repo" {
      + aliases                        = [
          + "cdn.infrahouse.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + staging                        = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = (known after apply)
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "ih-backend"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "https-only"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "infrahouse.com"
          + origin_id           = "ih-backend"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = [
                  + "CN",
                  + "IR",
                  + "RU",
                ]
              + restriction_type = "blacklist"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.cdn.aws_route53_record.cert_validation["cdn.infrahouse.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.webserver_permissions: Reading...%0Adata.aws_iam_policy_document.webserver_permissions: Read complete after 0s [id=2218315402]%0Amodule.website-vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0ae798f941be45345]%0Adata.aws_availability_zones.uw1: Reading...%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.website.module.webserver_profile.data.aws_iam_policy_document.assume: Reading...%0Adata.aws_key_pair.aleks: Reading...%0Amodule.website.module.webserver_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/webserver20230818170808801500000002]%0Amodule.website.aws_acm_certificate.website: Refreshing state... [id=arn:aws:acm:us-west-1:493370826424:certificate/7f501a3e-e93a-4d97-99e3-c6bf573c59be]%0Amodule.website.data.aws_route53_zone.website: Reading...%0Amodule.website.module.webserver_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=2851119427]%0Amodule.webserver_userdata.data.aws_region.current: Reading...%0Amodule.website-vpc.data.aws_vpc.management_vpc[0]: Reading...%0Amodule.webserver_userdata.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.website.data.aws_caller_identity.current: Reading...%0Adata.aws_key_pair.aleks: Read complete after 0s [id=key-01c98b9723b518061]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.website.module.webserver_profile.aws_iam_role.profile: Refreshing state... [id=webserver20230818170808794200000001]%0Amodule.cdn.data.aws_route53_zone.ih_com: Reading...%0Amodule.webserver_userdata.data.template_cloudinit_config.config: Reading...%0Amodule.webserver_userdata.data.template_cloudinit_config.config: Read complete after 0s [id=1138369615]%0Adata.aws_ami.ubuntu_22: Read complete after 0s [id=ami-01973462ceff35e85]%0Amodule.website-vpc.aws_eip.nat_eip["10.0.4.0/24"]: Refreshing state... [id=eipalloc-03ad22a4199a2bfe5]%0Amodule.website-vpc.aws_eip.nat_eip["10.0.5.0/24"]: Refreshing state... [id=eipalloc-0beb080e46efeb93f]%0Amodule.website.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.website-vpc.data.aws_vpc.management_vpc[0]: Read complete after 0s [id=vpc-08e19d859c26d18b2]%0Amodule.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Reading...%0Amodule.website-vpc.data.aws_route_tables.mgmt_route_tables[0]: Read complete after 0s [id=us-west-1]%0Amodule.website.module.webserver_profile.aws_iam_role_policy_attachment.profile: Refreshing state... [id=webserver20230818170808794200000001-20230818170809342500000004]%0Amodule.website.module.webserver_profile.aws_iam_instance_profile.profile: Refreshing state... [id=webserver]%0Amodule.website-vpc.aws_route_table.all["10.0.5.0/24"]: Refreshing state... [id=rtb-0fc65675e5ce07bbf]%0Amodule.website-vpc.aws_route_table.all["10.0.4.0/24"]: Refreshing state... [id=rtb-02ae9fc349324835b]%0Amodule.website-vpc.aws_internet_gateway.ig: Refreshing state... [id=igw-0feb8f579048fc443]%0Amodule.website-vpc.aws_default_route_table.default: Refreshing state... [id=rtb-06b702bdb0cadd810]%0Amodule.website-vpc.aws_default_security_group.default: Refreshing state... [id=sg-089f1a85f05cbd32a]%0Amodule.website-vpc.aws_route_table.all["10.0.6.0/24"]: Refreshing state... [id=rtb-0decbbf0182384dff]%0Amodule.website-vpc.aws_route_table.all["10.0.7.0/24"]: Refreshing state... [id=rtb-0f0d4ab6650ed47a4]%0Amodule.website-vpc.aws_subnet.all["10.0.4.0/24"]: Refreshing state... [id=subnet-086ccf1b7842243d2]%0Amodule.website-vpc.aws_vpc_peering_connection.link_to_management[0]: Refreshing state... [id=pcx-0fd00008e9a890b35]%0Amodule.website.data.aws_route53_zone.website: Read complete after 0s [id=Z07662251LH3YRF2ERM3G]%0Amodule.website-vpc.aws_subnet.all["10.0.6.0/24"]: Refreshing state... [id=subnet-01306fa9e14f9c980]%0Amodule.website-vpc.aws_subnet.all["10.0.5.0/24"]: Refreshing state... [id=subnet-05fa33164c768ab65]%0Amodule.website-vpc.aws_subnet.all["10.0.7.0/24"]: Refreshing state... [id=subnet-06f352185ffc3fcd3]%0Amodule.website.aws_route53_record.cert_validation["infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__7504c5c7bdc49a6bdcad50fc7d6b4697.infrahouse.com._CNAME]%0Amodule.website.aws_route53_record.cert_validation["www.infrahouse.com"]: Refreshing state... [id=Z07662251LH3YRF2ERM3G__c90556bdf2a7f789401f1ec05a0cb560.www.infrahouse.com._CNAME]%0Amodule.website-vpc.aws_route.default_main: Refreshing state... [id=r-rtb-06b702bdb0cadd8101080289494]%0Amodule.website-vpc.aws_route.subnet_public["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b1080289494]%0Amodule.website-vpc.aws_route.subnet_public["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf1080289494]%0Amodule.website.aws_launch_template.website: Refreshing state... [id=lt-0cbf545f2a4d9f53c]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.5.0/24"]: Refreshing state... [id=r-rtb-0fc65675e5ce07bbf653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a4653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff653952448]%0Amodule.website-vpc.aws_route.route_from_me_to_mgmt["10.0.4.0/24"]: Refreshing state... [id=r-rtb-02ae9fc349324835b653952448]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[0]: Refreshing state... [id=r-rtb-0d73383afeb6ad1423177957334]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[1]: Refreshing state... [id=r-rtb-04a16e74d5b12a3383177957334]%0Amodule.website-vpc.aws_route.route_from_mgmt_to_me[2]: Refreshing state... [id=r-rtb-067c30e65dd4108e93177957334]%0Amodule.website-vpc.aws_nat_gateway.nat_gw["10.0.5.0/24"]: Refreshing state... [id=nat-00ac19ae43562352f]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.4.0/24"]: Refreshing state... [id=rtbassoc-04d711a4b92896be2]%0Amodule.website-vpc.aws_nat_gateway.nat_gw["10.0.4.0/24"]: Refreshing state... [id=nat-0a1c16012747ef5e4]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.5.0/24"]: Refreshing state... [id=rtbassoc-0716045ba5eb092f0]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.6.0/24"]: Refreshing state... [id=rtbassoc-0c1a3e4c874333baf]%0Amodule.website-vpc.aws_route_table_association.private_rt_assoc["10.0.7.0/24"]: Refreshing state... [id=rtbassoc-0da0fea7d999fcf5f]%0Amodule.website.data.aws_subnet.selected: Reading...%0Amodule.website.aws_alb.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/web20230818170821317100000008/03a64b8fc9f0f055]%0Amodule.website-vpc.aws_route.subnet_private["10.0.7.0/24"]: Refreshing state... [id=r-rtb-0f0d4ab6650ed47a41080289494]%0Amodule.website-vpc.aws_route.subnet_private["10.0.6.0/24"]: Refreshing state... [id=r-rtb-0decbbf0182384dff1080289494]%0Amodule.website.data.aws_subnet.selected: Read complete after 0s [id=subnet-086ccf1b7842243d2]%0Amodule.website.aws_alb_target_group.website: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-2023081817082140120000000a/4bab1c874db740af]%0Amodule.cdn.data.aws_route53_zone.ih_com: Read complete after 1s [id=Z07662251LH3YRF2ERM3G]%0Amodule.website.aws_acm_certificate_validation.website: Refreshing state... [id=2023-08-18 17:08:33.177 +0000 UTC]%0Amodule.website.aws_route53_record.primary: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_A]%0Amodule.website.aws_route53_record.extra[0]: Refreshing state... [id=Z07662251LH3YRF2ERM3G_www_A]%0Amodule.website.aws_alb_listener.redirect_to_ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/3d984bc9f1cc3a7d]%0Amodule.website.aws_lb_listener.ssl: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/web20230818170821317100000008/03a64b8fc9f0f055/46afaa712ae9fb70]%0Amodule.website.aws_autoscaling_group.website: Refreshing state... [id=web-2023081817082248860000000b]%0Amodule.website.aws_autoscaling_policy.cpu_load: Refreshing state... [id=web-2023081817082248860000000b]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.cdn.aws_acm_certificate.cdn will be created%0A  + resource "aws_acm_certificate" "cdn" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "cdn.infrahouse.com"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "cdn.infrahouse.com"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "cdn.infrahouse.com",%0A        ]%0A      + tags_all                  = {%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A    }%0A%0A  # module.cdn.aws_acm_certificate_validation.repo will be created%0A  + resource "aws_acm_certificate_validation" "repo" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + validation_record_fqdns = (known after apply)%0A    }%0A%0A  # module.cdn.aws_cloudfront_cache_policy.default will be created%0A  + resource "aws_cloudfront_cache_policy" "default" {%0A      + default_ttl = 300%0A      + etag        = (known after apply)%0A      + id          = (known after apply)%0A      + max_ttl     = 600%0A      + min_ttl     = 60%0A      + name        = "ih-backend_default"%0A%0A      + parameters_in_cache_key_and_forwarded_to_origin {%0A          + cookies_config {%0A              + cookie_behavior = "none"%0A            }%0A          + headers_config {%0A              + header_behavior = "none"%0A            }%0A          + query_strings_config {%0A              + query_string_behavior = "none"%0A            }%0A        }%0A    }%0A%0A  # module.cdn.aws_cloudfront_distribution.repo will be created%0A  + resource "aws_cloudfront_distribution" "repo" {%0A      + aliases                        = [%0A          + "cdn.infrahouse.com",%0A        ]%0A      + arn                            = (known after apply)%0A      + caller_reference               = (known after apply)%0A      + domain_name                    = (known after apply)%0A      + enabled                        = true%0A      + etag                           = (known after apply)%0A      + hosted_zone_id                 = (known after apply)%0A      + http_version                   = "http2"%0A      + id                             = (known after apply)%0A      + in_progress_validation_batches = (known after apply)%0A      + is_ipv6_enabled                = true%0A      + last_modified_time             = (known after apply)%0A      + price_class                    = "PriceClass_All"%0A      + retain_on_delete               = false%0A      + staging                        = false%0A      + status                         = (known after apply)%0A      + tags_all                       = {%0A          + "created_by"  = "infrahouse/infrahouse-website-infra"%0A          + "environment" = "production"%0A        }%0A      + trusted_key_groups             = (known after apply)%0A      + trusted_signers                = (known after apply)%0A      + wait_for_deployment            = true%0A%0A      + default_cache_behavior {%0A          + allowed_methods        = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + cache_policy_id        = (known after apply)%0A          + cached_methods         = [%0A              + "GET",%0A              + "HEAD",%0A            ]%0A          + compress               = false%0A          + default_ttl            = (known after apply)%0A          + max_ttl                = (known after apply)%0A          + min_ttl                = 0%0A          + target_origin_id       = "ih-backend"%0A          + trusted_key_groups     = (known after apply)%0A          + trusted_signers        = (known after apply)%0A          + viewer_protocol_policy = "https-only"%0A        }%0A%0A      + origin {%0A          + connection_attempts = 3%0A          + connection_timeout  = 10%0A          + domain_name         = "infrahouse.com"%0A          + origin_id           = "ih-backend"%0A%0A          + custom_origin_config {%0A              + http_port                = 80%0A              + https_port               = 443%0A              + origin_keepalive_timeout = 5%0A              + origin_protocol_policy   = "https-only"%0A              + origin_read_timeout      = 30%0A              + origin_ssl_protocols     = [%0A                  + "TLSv1",%0A                  + "TLSv1.1",%0A                  + "TLSv1.2",%0A                ]%0A            }%0A        }%0A%0A      + restrictions {%0A          + geo_restriction {%0A              + locations        = [%0A                  + "CN",%0A                  + "IR",%0A                  + "RU",%0A                ]%0A              + restriction_type = "blacklist"%0A            }%0A        }%0A%0A      + viewer_certificate {%0A          + acm_certificate_arn      = (known after apply)%0A          + minimum_protocol_version = "TLSv1"%0A          + ssl_support_method       = "sni-only"%0A        }%0A    }%0A%0A  # module.cdn.aws_route53_record.cert_validation["cdn.infrahouse.com"] will be created%0A  + resource "aws_route53_record" "cert_validation" {%0A      + allow_overwrite = (known after apply)%0A      + fqdn            = (known after apply)%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A      + records         = (known after apply)%0A      + ttl             = 60%0A      + type            = (known after apply)%0A      + zone_id         = "Z07662251LH3YRF2ERM3G"%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvNTRkNGMwYmQtOTUzMy00MjMyLWFmOWUtNTBmZjY4NjU5NzE2L3RlcnJhZm9ybS1iaW4gcGxhbiAtbm8tY29sb3IgLS1vdXQ9dGYucGxhblxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzZXJ2ZXJfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2VydmVyX3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE4MzE1NDAyXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMGFlNzk4Zjk0MWJlNDUzNDVdXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uXG5tb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2tleV9wYWlyLmFsZWtzOiBSZWFkaW5nLi4uXG5tb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvd2Vic2VydmVyMjAyMzA4MTgxNzA4MDg4MDE1MDAwMDAwMDJdXG5tb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvN2Y1MDFhM2UtZTkzYS00ZDk3LTk5ZTMtYzZiZjU3M2M1OWJlXVxubW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNpdGU6IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg1MTExOTQyN11cbm1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzaXRlLXZwYy5kYXRhLmF3c192cGMubWFuYWdlbWVudF92cGNbMF06IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV1cbm1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkaW5nLi4uXG5kYXRhLmF3c19rZXlfcGFpci5hbGVrczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9a2V5LTAxYzk4Yjk3MjNiNTE4MDYxXVxuZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODc5NDIwMDAwMDAwMV1cbm1vZHVsZS5jZG4uZGF0YS5hd3Nfcm91dGU1M196b25lLmloX2NvbTogUmVhZGluZy4uLlxubW9kdWxlLndlYnNlcnZlcl91c2VyZGF0YS5kYXRhLnRlbXBsYXRlX2Nsb3VkaW5pdF9jb25maWcuY29uZmlnOiBSZWFkaW5nLi4uXG5tb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEudGVtcGxhdGVfY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExMzgzNjk2MTVdXG5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDE5NzM0NjJjZWZmMzVlODVdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTAzYWQyMmE0MTk5YTJiZmU1XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19laXAubmF0X2VpcFtcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wYmViMDgwZTQ2ZWZlYjkzZl1cbm1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdXG5tb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3NfdnBjLm1hbmFnZW1lbnRfdnBjWzBdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdXG5tb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3Nfcm91dGVfdGFibGVzLm1nbXRfcm91dGVfdGFibGVzWzBdOiBSZWFkaW5nLi4uXG5tb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3Nfcm91dGVfdGFibGVzLm1nbXRfcm91dGVfdGFibGVzWzBdOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXG5tb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNlcnZlcjIwMjMwODE4MTcwODA4Nzk0MjAwMDAwMDAxLTIwMjMwODE4MTcwODA5MzQyNTAwMDAwMDA0XVxubW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXJdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGZjNjU2NzVlNWNlMDdiYmZdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDJhZTlmYzM0OTMyNDgzNWJdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wZmViOGY1NzkwNDhmYzQ0M11cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDZiNzAyYmRiMGNhZGQ4MTBdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDg5ZjFhODVmMDVjYmQzMmFdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGRlY2JiZjAxODIzODRkZmZdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGYwZDRhYjY2NTBlZDQ3YTRdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA4NmNjZjFiNzg0MjI0M2QyXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGNfcGVlcmluZ19jb25uZWN0aW9uLmxpbmtfdG9fbWFuYWdlbWVudFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cGN4LTBmZDAwMDA4ZTlhODkwYjM1XVxubW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfcm91dGU1M196b25lLndlYnNpdGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR11cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDEzMDZmYTllMTRmOWM5ODBdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA1ZmEzMzE2NGM3NjhhYjY1XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC43LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wNmYzNTIxODVmZmMzZmNkM11cbm1vZHVsZS53ZWJzaXRlLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJpbmZyYWhvdXNlLmNvbVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX183NTA0YzVjN2JkYzQ5YTZiZGNhZDUwZmM3ZDZiNDY5Ny5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdXG5tb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wid3d3LmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfX2M5MDU1NmJkZjJhN2Y3ODk0MDFmMWVjMDVhMGNiNTYwLnd3dy5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDZiNzAyYmRiMGNhZGQ4MTAxMDgwMjg5NDk0XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAyYWU5ZmMzNDkzMjQ4MzViMTA4MDI4OTQ5NF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZmM2NTY3NWU1Y2UwN2JiZjEwODAyODk0OTRdXG5tb2R1bGUud2Vic2l0ZS5hd3NfbGF1bmNoX3RlbXBsYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWx0LTBjYmY1NDVmMmE0ZDlmNTNjXVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21lX3RvX21nbXRbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGZjNjU2NzVlNWNlMDdiYmY2NTM5NTI0NDhdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZjBkNGFiNjY1MGVkNDdhNDY1Mzk1MjQ0OF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZV90b19tZ210W1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkZWNiYmYwMTgyMzg0ZGZmNjUzOTUyNDQ4XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21lX3RvX21nbXRbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDJhZTlmYzM0OTMyNDgzNWI2NTM5NTI0NDhdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWdtdF90b19tZVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGQ3MzM4M2FmZWI2YWQxNDIzMTc3OTU3MzM0XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21nbXRfdG9fbWVbMV06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA0YTE2ZTc0ZDViMTJhMzM4MzE3Nzk1NzMzNF1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZ210X3RvX21lWzJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOTMxNzc5NTczMzRdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDBhYzE5YWU0MzU2MjM1MmZdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDRkNzExYTRiOTI4OTZiZTJdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMGExYzE2MDEyNzQ3ZWY1ZTRdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDcxNjA0NWJhNWViMDkyZjBdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjYuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMGMxYTNlNGM4NzQzMzNiYWZdXG5tb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMGRhMGZlYTdkOTk5ZmNmNWZdXG5tb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi5cbm1vZHVsZS53ZWJzaXRlLmF3c19hbGIud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OmxvYWRiYWxhbmNlci9hcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NV1cbm1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGYwZDRhYjY2NTBlZDQ3YTQxMDgwMjg5NDk0XVxubW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjEwODAyODk0OTRdXG5tb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXN1Ym5ldC0wODZjY2YxYjc4NDIyNDNkMl1cbm1vZHVsZS53ZWJzaXRlLmF3c19hbGJfdGFyZ2V0X2dyb3VwLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDp0YXJnZXRncm91cC90Zi0yMDIzMDgxODE3MDgyMTQwMTIwMDAwMDAwYS80YmFiMWM4NzRkYjc0MGFmXVxubW9kdWxlLmNkbi5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuaWhfY29tOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddXG5tb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MjAyMy0wOC0xOCAxNzowODozMy4xNzcgKzAwMDAgVVRDXVxubW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLnByaW1hcnk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9BXVxubW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLmV4dHJhWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfd3d3X0FdXG5tb2R1bGUud2Vic2l0ZS5hd3NfYWxiX2xpc3RlbmVyLnJlZGlyZWN0X3RvX3NzbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0Omxpc3RlbmVyL2FwcC93ZWIyMDIzMDgxODE3MDgyMTMxNzEwMDAwMDAwOC8wM2E2NGI4ZmM5ZjBmMDU1LzNkOTg0YmM5ZjFjYzNhN2RdXG5tb2R1bGUud2Vic2l0ZS5hd3NfbGJfbGlzdGVuZXIuc3NsOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmVsYXN0aWNsb2FkYmFsYW5jaW5nOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6bGlzdGVuZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTUvNDZhZmFhNzEyYWU5ZmI3MF1cbm1vZHVsZS53ZWJzaXRlLmF3c19hdXRvc2NhbGluZ19ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJdXG5tb2R1bGUud2Vic2l0ZS5hd3NfYXV0b3NjYWxpbmdfcG9saWN5LmNwdV9sb2FkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBtb2R1bGUuY2RuLmF3c19hY21fY2VydGlmaWNhdGUuY2RuIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2FjbV9jZXJ0aWZpY2F0ZVwiIFwiY2RuXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkb21haW5fbmFtZSAgICAgICAgICAgICAgID0gXCJjZG4uaW5mcmFob3VzZS5jb21cIlxuICAgICAgKyBkb21haW5fdmFsaWRhdGlvbl9vcHRpb25zID0gW1xuICAgICAgICAgICsge1xuICAgICAgICAgICAgICArIGRvbWFpbl9uYW1lICAgICAgICAgICA9IFwiY2RuLmluZnJhaG91c2UuY29tXCJcbiAgICAgICAgICAgICAgKyByZXNvdXJjZV9yZWNvcmRfbmFtZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgcmVzb3VyY2VfcmVjb3JkX3R5cGUgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIHJlc291cmNlX3JlY29yZF92YWx1ZSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH0sXG4gICAgICAgIF1cbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsga2V5X2FsZ29yaXRobSAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbm90X2FmdGVyICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbm90X2JlZm9yZSAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGVuZGluZ19yZW5ld2FsICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVuZXdhbF9lbGlnaWJpbGl0eSAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVuZXdhbF9zdW1tYXJ5ICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RhdHVzICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3ViamVjdF9hbHRlcm5hdGl2ZV9uYW1lcyA9IFtcbiAgICAgICAgICArIFwiY2RuLmluZnJhaG91c2UuY29tXCIsXG4gICAgICAgIF1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgfVxuICAgICAgKyB0eXBlICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB2YWxpZGF0aW9uX2VtYWlscyAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB2YWxpZGF0aW9uX21ldGhvZCAgICAgICAgID0gXCJETlNcIlxuICAgIH1cblxuICAjIG1vZHVsZS5jZG4uYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLnJlcG8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb25cIiBcInJlcG9cIiB7XG4gICAgICArIGNlcnRpZmljYXRlX2FybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdmFsaWRhdGlvbl9yZWNvcmRfZnFkbnMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmNkbi5hd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3kuZGVmYXVsdCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19jbG91ZGZyb250X2NhY2hlX3BvbGljeVwiIFwiZGVmYXVsdFwiIHtcbiAgICAgICsgZGVmYXVsdF90dGwgPSAzMDBcbiAgICAgICsgZXRhZyAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYXhfdHRsICAgICA9IDYwMFxuICAgICAgKyBtaW5fdHRsICAgICA9IDYwXG4gICAgICArIG5hbWUgICAgICAgID0gXCJpaC1iYWNrZW5kX2RlZmF1bHRcIlxuXG4gICAgICArIHBhcmFtZXRlcnNfaW5fY2FjaGVfa2V5X2FuZF9mb3J3YXJkZWRfdG9fb3JpZ2luIHtcbiAgICAgICAgICArIGNvb2tpZXNfY29uZmlnIHtcbiAgICAgICAgICAgICAgKyBjb29raWVfYmVoYXZpb3IgPSBcIm5vbmVcIlxuICAgICAgICAgICAgfVxuICAgICAgICAgICsgaGVhZGVyc19jb25maWcge1xuICAgICAgICAgICAgICArIGhlYWRlcl9iZWhhdmlvciA9IFwibm9uZVwiXG4gICAgICAgICAgICB9XG4gICAgICAgICAgKyBxdWVyeV9zdHJpbmdzX2NvbmZpZyB7XG4gICAgICAgICAgICAgICsgcXVlcnlfc3RyaW5nX2JlaGF2aW9yID0gXCJub25lXCJcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5jZG4uYXdzX2Nsb3VkZnJvbnRfZGlzdHJpYnV0aW9uLnJlcG8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfY2xvdWRmcm9udF9kaXN0cmlidXRpb25cIiBcInJlcG9cIiB7XG4gICAgICArIGFsaWFzZXMgICAgICAgICAgICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICArIFwiY2RuLmluZnJhaG91c2UuY29tXCIsXG4gICAgICAgIF1cbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjYWxsZXJfcmVmZXJlbmNlICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRvbWFpbl9uYW1lICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZW5hYmxlZCAgICAgICAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBldGFnICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaHR0cF92ZXJzaW9uICAgICAgICAgICAgICAgICAgID0gXCJodHRwMlwiXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaW5fcHJvZ3Jlc3NfdmFsaWRhdGlvbl9iYXRjaGVzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpc19pcHY2X2VuYWJsZWQgICAgICAgICAgICAgICAgPSB0cnVlXG4gICAgICArIGxhc3RfbW9kaWZpZWRfdGltZSAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpY2VfY2xhc3MgICAgICAgICAgICAgICAgICAgID0gXCJQcmljZUNsYXNzX0FsbFwiXG4gICAgICArIHJldGFpbl9vbl9kZWxldGUgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIHN0YWdpbmcgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIHN0YXR1cyAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICB9XG4gICAgICArIHRydXN0ZWRfa2V5X2dyb3VwcyAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdHJ1c3RlZF9zaWduZXJzICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB3YWl0X2Zvcl9kZXBsb3ltZW50ICAgICAgICAgICAgPSB0cnVlXG5cbiAgICAgICsgZGVmYXVsdF9jYWNoZV9iZWhhdmlvciB7XG4gICAgICAgICAgKyBhbGxvd2VkX21ldGhvZHMgICAgICAgID0gW1xuICAgICAgICAgICAgICArIFwiR0VUXCIsXG4gICAgICAgICAgICAgICsgXCJIRUFEXCIsXG4gICAgICAgICAgICBdXG4gICAgICAgICAgKyBjYWNoZV9wb2xpY3lfaWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICsgY2FjaGVkX21ldGhvZHMgICAgICAgICA9IFtcbiAgICAgICAgICAgICAgKyBcIkdFVFwiLFxuICAgICAgICAgICAgICArIFwiSEVBRFwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgY29tcHJlc3MgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgKyBkZWZhdWx0X3R0bCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICsgbWF4X3R0bCAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICArIG1pbl90dGwgICAgICAgICAgICAgICAgPSAwXG4gICAgICAgICAgKyB0YXJnZXRfb3JpZ2luX2lkICAgICAgID0gXCJpaC1iYWNrZW5kXCJcbiAgICAgICAgICArIHRydXN0ZWRfa2V5X2dyb3VwcyAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgKyB0cnVzdGVkX3NpZ25lcnMgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICsgdmlld2VyX3Byb3RvY29sX3BvbGljeSA9IFwiaHR0cHMtb25seVwiXG4gICAgICAgIH1cblxuICAgICAgKyBvcmlnaW4ge1xuICAgICAgICAgICsgY29ubmVjdGlvbl9hdHRlbXB0cyA9IDNcbiAgICAgICAgICArIGNvbm5lY3Rpb25fdGltZW91dCAgPSAxMFxuICAgICAgICAgICsgZG9tYWluX25hbWUgICAgICAgICA9IFwiaW5mcmFob3VzZS5jb21cIlxuICAgICAgICAgICsgb3JpZ2luX2lkICAgICAgICAgICA9IFwiaWgtYmFja2VuZFwiXG5cbiAgICAgICAgICArIGN1c3RvbV9vcmlnaW5fY29uZmlnIHtcbiAgICAgICAgICAgICAgKyBodHRwX3BvcnQgICAgICAgICAgICAgICAgPSA4MFxuICAgICAgICAgICAgICArIGh0dHBzX3BvcnQgICAgICAgICAgICAgICA9IDQ0M1xuICAgICAgICAgICAgICArIG9yaWdpbl9rZWVwYWxpdmVfdGltZW91dCA9IDVcbiAgICAgICAgICAgICAgKyBvcmlnaW5fcHJvdG9jb2xfcG9saWN5ICAgPSBcImh0dHBzLW9ubHlcIlxuICAgICAgICAgICAgICArIG9yaWdpbl9yZWFkX3RpbWVvdXQgICAgICA9IDMwXG4gICAgICAgICAgICAgICsgb3JpZ2luX3NzbF9wcm90b2NvbHMgICAgID0gW1xuICAgICAgICAgICAgICAgICAgKyBcIlRMU3YxXCIsXG4gICAgICAgICAgICAgICAgICArIFwiVExTdjEuMVwiLFxuICAgICAgICAgICAgICAgICAgKyBcIlRMU3YxLjJcIixcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cblxuICAgICAgKyByZXN0cmljdGlvbnMge1xuICAgICAgICAgICsgZ2VvX3Jlc3RyaWN0aW9uIHtcbiAgICAgICAgICAgICAgKyBsb2NhdGlvbnMgICAgICAgID0gW1xuICAgICAgICAgICAgICAgICAgKyBcIkNOXCIsXG4gICAgICAgICAgICAgICAgICArIFwiSVJcIixcbiAgICAgICAgICAgICAgICAgICsgXCJSVVwiLFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyByZXN0cmljdGlvbl90eXBlID0gXCJibGFja2xpc3RcIlxuICAgICAgICAgICAgfVxuICAgICAgICB9XG5cbiAgICAgICsgdmlld2VyX2NlcnRpZmljYXRlIHtcbiAgICAgICAgICArIGFjbV9jZXJ0aWZpY2F0ZV9hcm4gICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICArIG1pbmltdW1fcHJvdG9jb2xfdmVyc2lvbiA9IFwiVExTdjFcIlxuICAgICAgICAgICsgc3NsX3N1cHBvcnRfbWV0aG9kICAgICAgID0gXCJzbmktb25seVwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuY2RuLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJjZG4uaW5mcmFob3VzZS5jb21cIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfcm91dGU1M19yZWNvcmRcIiBcImNlcnRfdmFsaWRhdGlvblwiIHtcbiAgICAgICsgYWxsb3dfb3ZlcndyaXRlID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmcWRuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZWNvcmRzICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHR0bCAgICAgICAgICAgICA9IDYwXG4gICAgICArIHR5cGUgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgem9uZV9pZCAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dcIlxuICAgIH1cblxuUGxhbjogNSB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2VydmVyX3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzZXJ2ZXJfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTgzMTU0MDJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMGFlNzk4Zjk0MWJlNDUzNDVdJTBBZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS5tb2R1bGUud2Vic2VydmVyX3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19rZXlfcGFpci5hbGVrczogUmVhZGluZy4uLiUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS93ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODgwMTUwMDAwMDAwMl0lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWNtX2NlcnRpZmljYXRlLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6YWNtOnVzLXdlc3QtMTo0OTMzNzA4MjY0MjQ6Y2VydGlmaWNhdGUvN2Y1MDFhM2UtZTkzYS00ZDk3LTk5ZTMtYzZiZjU3M2M1OWJlXSUwQW1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzaXRlOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODUxMTE5NDI3XSUwQW1vZHVsZS53ZWJzZXJ2ZXJfdXNlcmRhdGEuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3NfdnBjLm1hbmFnZW1lbnRfdnBjWzBdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNlcnZlcl91c2VyZGF0YS5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQW1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkaW5nLi4uJTBBZGF0YS5hd3Nfa2V5X3BhaXIuYWxla3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWtleS0wMWM5OGI5NzIzYjUxODA2MV0lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXIyMDIzMDgxODE3MDgwODc5NDIwMDAwMDAwMV0lMEFtb2R1bGUuY2RuLmRhdGEuYXdzX3JvdXRlNTNfem9uZS5paF9jb206IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEudGVtcGxhdGVfY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2VydmVyX3VzZXJkYXRhLmRhdGEudGVtcGxhdGVfY2xvdWRpbml0X2NvbmZpZy5jb25maWc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExMzgzNjk2MTVdJTBBZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTAxOTczNDYyY2VmZjM1ZTg1XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDNhZDIyYTQxOTlhMmJmZTVdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19laXAubmF0X2VpcFtcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wYmViMDgwZTQ2ZWZlYjkzZl0lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5kYXRhLmF3c192cGMubWFuYWdlbWVudF92cGNbMF06IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuZGF0YS5hd3Nfcm91dGVfdGFibGVzLm1nbXRfcm91dGVfdGFibGVzWzBdOiBSZWFkaW5nLi4uJTBBbW9kdWxlLndlYnNpdGUtdnBjLmRhdGEuYXdzX3JvdXRlX3RhYmxlcy5tZ210X3JvdXRlX3RhYmxlc1swXTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQW1vZHVsZS53ZWJzaXRlLm1vZHVsZS53ZWJzZXJ2ZXJfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2VydmVyMjAyMzA4MTgxNzA4MDg3OTQyMDAwMDAwMDEtMjAyMzA4MTgxNzA4MDkzNDI1MDAwMDAwMDRdJTBBbW9kdWxlLndlYnNpdGUubW9kdWxlLndlYnNlcnZlcl9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzZXJ2ZXJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmYzY1Njc1ZTVjZTA3YmJmXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1Yl0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wZmViOGY1NzkwNDhmYzQ0M10lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA2YjcwMmJkYjBjYWRkODEwXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfZGVmYXVsdF9zZWN1cml0eV9ncm91cC5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wODlmMWE4NWYwNWNiZDMyYV0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGRlY2JiZjAxODIzODRkZmZdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjcuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBmMGQ0YWI2NjUwZWQ0N2E0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c192cGNfcGVlcmluZ19jb25uZWN0aW9uLmxpbmtfdG9fbWFuYWdlbWVudFswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cGN4LTBmZDAwMDA4ZTlhODkwYjM1XSUwQW1vZHVsZS53ZWJzaXRlLmRhdGEuYXdzX3JvdXRlNTNfem9uZS53ZWJzaXRlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19zdWJuZXQuYWxsW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wMTMwNmZhOWUxNGY5Yzk4MF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA1ZmEzMzE2NGM3NjhhYjY1XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDZmMzUyMTg1ZmZjM2ZjZDNdJTBBbW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLmNlcnRfdmFsaWRhdGlvbltcImluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfXzc1MDRjNWM3YmRjNDlhNmJkY2FkNTBmYzdkNmI0Njk3LmluZnJhaG91c2UuY29tLl9DTkFNRV0lMEFtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQuY2VydF92YWxpZGF0aW9uW1wid3d3LmluZnJhaG91c2UuY29tXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfX2M5MDU1NmJkZjJhN2Y3ODk0MDFmMWVjMDVhMGNiNTYwLnd3dy5pbmZyYWhvdXNlLmNvbS5fQ05BTUVdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5kZWZhdWx0X21haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2YjcwMmJkYjBjYWRkODEwMTA4MDI4OTQ5NF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjQuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDJhZTlmYzM0OTMyNDgzNWIxMDgwMjg5NDk0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZmM2NTY3NWU1Y2UwN2JiZjEwODAyODk0OTRdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2xhdW5jaF90ZW1wbGF0ZS53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wY2JmNTQ1ZjJhNGQ5ZjUzY10lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZmM2NTY3NWU1Y2UwN2JiZjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZjBkNGFiNjY1MGVkNDdhNDY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWVfdG9fbWdtdFtcIjEwLjAuNC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMmFlOWZjMzQ5MzI0ODM1YjY1Mzk1MjQ0OF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlLnJvdXRlX2Zyb21fbWdtdF90b19tZVswXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGQ3MzM4M2FmZWI2YWQxNDIzMTc3OTU3MzM0XSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGUucm91dGVfZnJvbV9tZ210X3RvX21lWzFdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODMxNzc5NTczMzRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5yb3V0ZV9mcm9tX21nbXRfdG9fbWVbMl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2N2MzMGU2NWRkNDEwOGU5MzE3Nzk1NzMzNF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuNS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDBhYzE5YWU0MzU2MjM1MmZdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA0ZDcxMWE0YjkyODk2YmUyXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC40LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wYTFjMTYwMTI3NDdlZjVlNF0lMEFtb2R1bGUud2Vic2l0ZS12cGMuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjUuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDcxNjA0NWJhNWViMDkyZjBdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC42LjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBjMWEzZTRjODc0MzMzYmFmXSUwQW1vZHVsZS53ZWJzaXRlLXZwYy5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wZGEwZmVhN2Q5OTlmY2Y1Zl0lMEFtb2R1bGUud2Vic2l0ZS5kYXRhLmF3c19zdWJuZXQuc2VsZWN0ZWQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUud2Vic2l0ZS5hd3NfYWxiLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsb2FkYmFsYW5jZXIvYXBwL3dlYjIwMjMwODE4MTcwODIxMzE3MTAwMDAwMDA4LzAzYTY0YjhmYzlmMGYwNTVdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuNy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZjBkNGFiNjY1MGVkNDdhNDEwODAyODk0OTRdJTBBbW9kdWxlLndlYnNpdGUtdnBjLmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuNi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZGVjYmJmMDE4MjM4NGRmZjEwODAyODk0OTRdJTBBbW9kdWxlLndlYnNpdGUuZGF0YS5hd3Nfc3VibmV0LnNlbGVjdGVkOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1zdWJuZXQtMDg2Y2NmMWI3ODQyMjQzZDJdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2FsYl90YXJnZXRfZ3JvdXAud2Vic2l0ZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czplbGFzdGljbG9hZGJhbGFuY2luZzp1cy13ZXN0LTE6NDkzMzcwODI2NDI0OnRhcmdldGdyb3VwL3RmLTIwMjMwODE4MTcwODIxNDAxMjAwMDAwMDBhLzRiYWIxYzg3NGRiNzQwYWZdJTBBbW9kdWxlLmNkbi5kYXRhLmF3c19yb3V0ZTUzX3pvbmUuaWhfY29tOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLndlYnNpdGUuYXdzX2FjbV9jZXJ0aWZpY2F0ZV92YWxpZGF0aW9uLndlYnNpdGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTIwMjMtMDgtMTggMTc6MDg6MzMuMTc3ICswMDAwIFVUQ10lMEFtb2R1bGUud2Vic2l0ZS5hd3Nfcm91dGU1M19yZWNvcmQucHJpbWFyeTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX0FdJTBBbW9kdWxlLndlYnNpdGUuYXdzX3JvdXRlNTNfcmVjb3JkLmV4dHJhWzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfd3d3X0FdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2FsYl9saXN0ZW5lci5yZWRpcmVjdF90b19zc2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsaXN0ZW5lci9hcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NS8zZDk4NGJjOWYxY2MzYTdkXSUwQW1vZHVsZS53ZWJzaXRlLmF3c19sYl9saXN0ZW5lci5zc2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6ZWxhc3RpY2xvYWRiYWxhbmNpbmc6dXMtd2VzdC0xOjQ5MzM3MDgyNjQyNDpsaXN0ZW5lci9hcHAvd2ViMjAyMzA4MTgxNzA4MjEzMTcxMDAwMDAwMDgvMDNhNjRiOGZjOWYwZjA1NS80NmFmYWE3MTJhZTlmYjcwXSUwQW1vZHVsZS53ZWJzaXRlLmF3c19hdXRvc2NhbGluZ19ncm91cC53ZWJzaXRlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWItMjAyMzA4MTgxNzA4MjI0ODg2MDAwMDAwMGJdJTBBbW9kdWxlLndlYnNpdGUuYXdzX2F1dG9zY2FsaW5nX3BvbGljeS5jcHVfbG9hZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2ViLTIwMjMwODE4MTcwODIyNDg4NjAwMDAwMDBiXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBtb2R1bGUuY2RuLmF3c19hY21fY2VydGlmaWNhdGUuY2RuIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19hY21fY2VydGlmaWNhdGVcIiBcImNkblwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkb21haW5fbmFtZSAgICAgICAgICAgICAgID0gXCJjZG4uaW5mcmFob3VzZS5jb21cIiUwQSAgICAgICsgZG9tYWluX3ZhbGlkYXRpb25fb3B0aW9ucyA9IFslMEEgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICArIGRvbWFpbl9uYW1lICAgICAgICAgICA9IFwiY2RuLmluZnJhaG91c2UuY29tXCIlMEEgICAgICAgICAgICAgICsgcmVzb3VyY2VfcmVjb3JkX25hbWUgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyByZXNvdXJjZV9yZWNvcmRfdHlwZSAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIHJlc291cmNlX3JlY29yZF92YWx1ZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICB9LCUwQSAgICAgICAgXSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGtleV9hbGdvcml0aG0gICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBub3RfYWZ0ZXIgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbm90X2JlZm9yZSAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBlbmRpbmdfcmVuZXdhbCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZW5ld2FsX2VsaWdpYmlsaXR5ICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVuZXdhbF9zdW1tYXJ5ICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0YXR1cyAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdWJqZWN0X2FsdGVybmF0aXZlX25hbWVzID0gWyUwQSAgICAgICAgICArIFwiY2RuLmluZnJhaG91c2UuY29tXCIsJTBBICAgICAgICBdJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB0eXBlICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdmFsaWRhdGlvbl9lbWFpbHMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHZhbGlkYXRpb25fbWV0aG9kICAgICAgICAgPSBcIkROU1wiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmNkbi5hd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb24ucmVwbyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfYWNtX2NlcnRpZmljYXRlX3ZhbGlkYXRpb25cIiBcInJlcG9cIiB7JTBBICAgICAgKyBjZXJ0aWZpY2F0ZV9hcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdmFsaWRhdGlvbl9yZWNvcmRfZnFkbnMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmNkbi5hd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3kuZGVmYXVsdCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfY2xvdWRmcm9udF9jYWNoZV9wb2xpY3lcIiBcImRlZmF1bHRcIiB7JTBBICAgICAgKyBkZWZhdWx0X3R0bCA9IDMwMCUwQSAgICAgICsgZXRhZyAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1heF90dGwgICAgID0gNjAwJTBBICAgICAgKyBtaW5fdHRsICAgICA9IDYwJTBBICAgICAgKyBuYW1lICAgICAgICA9IFwiaWgtYmFja2VuZF9kZWZhdWx0XCIlMEElMEEgICAgICArIHBhcmFtZXRlcnNfaW5fY2FjaGVfa2V5X2FuZF9mb3J3YXJkZWRfdG9fb3JpZ2luIHslMEEgICAgICAgICAgKyBjb29raWVzX2NvbmZpZyB7JTBBICAgICAgICAgICAgICArIGNvb2tpZV9iZWhhdmlvciA9IFwibm9uZVwiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgICArIGhlYWRlcnNfY29uZmlnIHslMEEgICAgICAgICAgICAgICsgaGVhZGVyX2JlaGF2aW9yID0gXCJub25lXCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICAgICsgcXVlcnlfc3RyaW5nc19jb25maWcgeyUwQSAgICAgICAgICAgICAgKyBxdWVyeV9zdHJpbmdfYmVoYXZpb3IgPSBcIm5vbmVcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuY2RuLmF3c19jbG91ZGZyb250X2Rpc3RyaWJ1dGlvbi5yZXBvIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19jbG91ZGZyb250X2Rpc3RyaWJ1dGlvblwiIFwicmVwb1wiIHslMEEgICAgICArIGFsaWFzZXMgICAgICAgICAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgKyBcImNkbi5pbmZyYWhvdXNlLmNvbVwiLCUwQSAgICAgICAgXSUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2FsbGVyX3JlZmVyZW5jZSAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZG9tYWluX25hbWUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5hYmxlZCAgICAgICAgICAgICAgICAgICAgICAgID0gdHJ1ZSUwQSAgICAgICsgZXRhZyAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaHR0cF92ZXJzaW9uICAgICAgICAgICAgICAgICAgID0gXCJodHRwMlwiJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbl9wcm9ncmVzc192YWxpZGF0aW9uX2JhdGNoZXMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpc19pcHY2X2VuYWJsZWQgICAgICAgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBsYXN0X21vZGlmaWVkX3RpbWUgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcmljZV9jbGFzcyAgICAgICAgICAgICAgICAgICAgPSBcIlByaWNlQ2xhc3NfQWxsXCIlMEEgICAgICArIHJldGFpbl9vbl9kZWxldGUgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBzdGFnaW5nICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgc3RhdHVzICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICB9JTBBICAgICAgKyB0cnVzdGVkX2tleV9ncm91cHMgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0cnVzdGVkX3NpZ25lcnMgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB3YWl0X2Zvcl9kZXBsb3ltZW50ICAgICAgICAgICAgPSB0cnVlJTBBJTBBICAgICAgKyBkZWZhdWx0X2NhY2hlX2JlaGF2aW9yIHslMEEgICAgICAgICAgKyBhbGxvd2VkX21ldGhvZHMgICAgICAgID0gWyUwQSAgICAgICAgICAgICAgKyBcIkdFVFwiLCUwQSAgICAgICAgICAgICAgKyBcIkhFQURcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgY2FjaGVfcG9saWN5X2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgKyBjYWNoZWRfbWV0aG9kcyAgICAgICAgID0gWyUwQSAgICAgICAgICAgICAgKyBcIkdFVFwiLCUwQSAgICAgICAgICAgICAgKyBcIkhFQURcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgY29tcHJlc3MgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgICAgICsgZGVmYXVsdF90dGwgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgKyBtYXhfdHRsICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICArIG1pbl90dGwgICAgICAgICAgICAgICAgPSAwJTBBICAgICAgICAgICsgdGFyZ2V0X29yaWdpbl9pZCAgICAgICA9IFwiaWgtYmFja2VuZFwiJTBBICAgICAgICAgICsgdHJ1c3RlZF9rZXlfZ3JvdXBzICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgKyB0cnVzdGVkX3NpZ25lcnMgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICArIHZpZXdlcl9wcm90b2NvbF9wb2xpY3kgPSBcImh0dHBzLW9ubHlcIiUwQSAgICAgICAgfSUwQSUwQSAgICAgICsgb3JpZ2luIHslMEEgICAgICAgICAgKyBjb25uZWN0aW9uX2F0dGVtcHRzID0gMyUwQSAgICAgICAgICArIGNvbm5lY3Rpb25fdGltZW91dCAgPSAxMCUwQSAgICAgICAgICArIGRvbWFpbl9uYW1lICAgICAgICAgPSBcImluZnJhaG91c2UuY29tXCIlMEEgICAgICAgICAgKyBvcmlnaW5faWQgICAgICAgICAgID0gXCJpaC1iYWNrZW5kXCIlMEElMEEgICAgICAgICAgKyBjdXN0b21fb3JpZ2luX2NvbmZpZyB7JTBBICAgICAgICAgICAgICArIGh0dHBfcG9ydCAgICAgICAgICAgICAgICA9IDgwJTBBICAgICAgICAgICAgICArIGh0dHBzX3BvcnQgICAgICAgICAgICAgICA9IDQ0MyUwQSAgICAgICAgICAgICAgKyBvcmlnaW5fa2VlcGFsaXZlX3RpbWVvdXQgPSA1JTBBICAgICAgICAgICAgICArIG9yaWdpbl9wcm90b2NvbF9wb2xpY3kgICA9IFwiaHR0cHMtb25seVwiJTBBICAgICAgICAgICAgICArIG9yaWdpbl9yZWFkX3RpbWVvdXQgICAgICA9IDMwJTBBICAgICAgICAgICAgICArIG9yaWdpbl9zc2xfcHJvdG9jb2xzICAgICA9IFslMEEgICAgICAgICAgICAgICAgICArIFwiVExTdjFcIiwlMEEgICAgICAgICAgICAgICAgICArIFwiVExTdjEuMVwiLCUwQSAgICAgICAgICAgICAgICAgICsgXCJUTFN2MS4yXCIsJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICB9JTBBICAgICAgICB9JTBBJTBBICAgICAgKyByZXN0cmljdGlvbnMgeyUwQSAgICAgICAgICArIGdlb19yZXN0cmljdGlvbiB7JTBBICAgICAgICAgICAgICArIGxvY2F0aW9ucyAgICAgICAgPSBbJTBBICAgICAgICAgICAgICAgICAgKyBcIkNOXCIsJTBBICAgICAgICAgICAgICAgICAgKyBcIklSXCIsJTBBICAgICAgICAgICAgICAgICAgKyBcIlJVXCIsJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgcmVzdHJpY3Rpb25fdHlwZSA9IFwiYmxhY2tsaXN0XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICB9JTBBJTBBICAgICAgKyB2aWV3ZXJfY2VydGlmaWNhdGUgeyUwQSAgICAgICAgICArIGFjbV9jZXJ0aWZpY2F0ZV9hcm4gICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgKyBtaW5pbXVtX3Byb3RvY29sX3ZlcnNpb24gPSBcIlRMU3YxXCIlMEEgICAgICAgICAgKyBzc2xfc3VwcG9ydF9tZXRob2QgICAgICAgPSBcInNuaS1vbmx5XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuY2RuLmF3c19yb3V0ZTUzX3JlY29yZC5jZXJ0X3ZhbGlkYXRpb25bXCJjZG4uaW5mcmFob3VzZS5jb21cIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3JvdXRlNTNfcmVjb3JkXCIgXCJjZXJ0X3ZhbGlkYXRpb25cIiB7JTBBICAgICAgKyBhbGxvd19vdmVyd3JpdGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmcWRuICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZWNvcmRzICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0dGwgICAgICAgICAgICAgPSA2MCUwQSAgICAgICsgdHlwZSAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgem9uZV9pZCAgICAgICAgID0gXCJaMDc2NjIyNTFMSDNZUkYyRVJNM0dcIiUwQSAgICB9JTBBJTBBUGxhbjogNSB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDUsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>